stm32duino/LSM6DSOX/src/lsm6dsox_reg.h
typedef enum {
  LSM6DSOX_CMP_DISABLE  = 0x00,
  LSM6DSOX_CMP_ALWAYS   = 0x04,
  LSM6DSOX_CMP_8_TO_1   = 0x05,
  LSM6DSOX_CMP_16_TO_1  = 0x06,
  LSM6DSOX_CMP_32_TO_1  = 0x07,
} lsm6dsox_uncoptr_rate_t;
int32_t lsm6dsox_compression_algo_set(lsm6dsox_ctx_t *ctx,
                                      lsm6dsox_uncoptr_rate_t val);
int32_t lsm6dsox_compression_algo_get(lsm6dsox_ctx_t *ctx,
                                      lsm6dsox_uncoptr_rate_t *val);

int32_t lsm6dsox_fifo_virtual_sens_odr_chg_set(lsm6dsox_ctx_t *ctx,
                                               uint8_t val);
int32_t lsm6dsox_fifo_virtual_sens_odr_chg_get(lsm6dsox_ctx_t *ctx,
                                               uint8_t *val);

int32_t lsm6dsox_compression_algo_real_time_set(lsm6dsox_ctx_t *ctx,
                                                uint8_t val);
int32_t lsm6dsox_compression_algo_real_time_get(lsm6dsox_ctx_t *ctx,
                                                uint8_t *val);

int32_t lsm6dsox_fifo_stop_on_wtm_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_fifo_stop_on_wtm_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSOX_XL_NOT_BATCHED       =  0,
  LSM6DSOX_XL_BATCHED_AT_12Hz5   =  1,
  LSM6DSOX_XL_BATCHED_AT_26Hz    =  2,
  LSM6DSOX_XL_BATCHED_AT_52Hz    =  3,
  LSM6DSOX_XL_BATCHED_AT_104Hz   =  4,
  LSM6DSOX_XL_BATCHED_AT_208Hz   =  5,
  LSM6DSOX_XL_BATCHED_AT_417Hz   =  6,
  LSM6DSOX_XL_BATCHED_AT_833Hz   =  7,
  LSM6DSOX_XL_BATCHED_AT_1667Hz  =  8,
  LSM6DSOX_XL_BATCHED_AT_3333Hz  =  9,
  LSM6DSOX_XL_BATCHED_AT_6667Hz  = 10,
  LSM6DSOX_XL_BATCHED_AT_6Hz5    = 11,
} lsm6dsox_bdr_xl_t;
int32_t lsm6dsox_fifo_xl_batch_set(lsm6dsox_ctx_t *ctx, lsm6dsox_bdr_xl_t val);
int32_t lsm6dsox_fifo_xl_batch_get(lsm6dsox_ctx_t *ctx, lsm6dsox_bdr_xl_t *val);

typedef enum {
  LSM6DSOX_GY_NOT_BATCHED         = 0,
  LSM6DSOX_GY_BATCHED_AT_12Hz5    = 1,
  LSM6DSOX_GY_BATCHED_AT_26Hz     = 2,
  LSM6DSOX_GY_BATCHED_AT_52Hz     = 3,
  LSM6DSOX_GY_BATCHED_AT_104Hz    = 4,
  LSM6DSOX_GY_BATCHED_AT_208Hz    = 5,
  LSM6DSOX_GY_BATCHED_AT_417Hz    = 6,
  LSM6DSOX_GY_BATCHED_AT_833Hz    = 7,
  LSM6DSOX_GY_BATCHED_AT_1667Hz   = 8,
  LSM6DSOX_GY_BATCHED_AT_3333Hz   = 9,
  LSM6DSOX_GY_BATCHED_AT_6667Hz   = 10,
  LSM6DSOX_GY_BATCHED_AT_6Hz5     = 11,
} lsm6dsox_bdr_gy_t;
int32_t lsm6dsox_fifo_gy_batch_set(lsm6dsox_ctx_t *ctx, lsm6dsox_bdr_gy_t val);
int32_t lsm6dsox_fifo_gy_batch_get(lsm6dsox_ctx_t *ctx, lsm6dsox_bdr_gy_t *val);

typedef enum {
  LSM6DSOX_BYPASS_MODE             = 0,
  LSM6DSOX_FIFO_MODE               = 1,
  LSM6DSOX_STREAM_TO_FIFO_MODE     = 3,
  LSM6DSOX_BYPASS_TO_STREAM_MODE   = 4,
  LSM6DSOX_STREAM_MODE             = 6,
  LSM6DSOX_BYPASS_TO_FIFO_MODE     = 7,
} lsm6dsox_fifo_mode_t;
int32_t lsm6dsox_fifo_mode_set(lsm6dsox_ctx_t *ctx, lsm6dsox_fifo_mode_t val);
int32_t lsm6dsox_fifo_mode_get(lsm6dsox_ctx_t *ctx, lsm6dsox_fifo_mode_t *val);

typedef enum {
  LSM6DSOX_TEMP_NOT_BATCHED        = 0,
  LSM6DSOX_TEMP_BATCHED_AT_1Hz6    = 1,
  LSM6DSOX_TEMP_BATCHED_AT_12Hz5   = 2,
  LSM6DSOX_TEMP_BATCHED_AT_52Hz    = 3,
} lsm6dsox_odr_t_batch_t;
int32_t lsm6dsox_fifo_temp_batch_set(lsm6dsox_ctx_t *ctx,
                                     lsm6dsox_odr_t_batch_t val);
int32_t lsm6dsox_fifo_temp_batch_get(lsm6dsox_ctx_t *ctx,
                                     lsm6dsox_odr_t_batch_t *val);

typedef enum {
  LSM6DSOX_NO_DECIMATION = 0,
  LSM6DSOX_DEC_1         = 1,
  LSM6DSOX_DEC_8         = 2,
  LSM6DSOX_DEC_32        = 3,
} lsm6dsox_odr_ts_batch_t;
int32_t lsm6dsox_fifo_timestamp_decimation_set(lsm6dsox_ctx_t *ctx,
                                               lsm6dsox_odr_ts_batch_t val);
int32_t lsm6dsox_fifo_timestamp_decimation_get(lsm6dsox_ctx_t *ctx,
                                               lsm6dsox_odr_ts_batch_t *val);

typedef enum {
  LSM6DSOX_XL_BATCH_EVENT   = 0,
  LSM6DSOX_GYRO_BATCH_EVENT = 1,
} lsm6dsox_trig_counter_bdr_t;

typedef enum {
  LSM6DSOX_GYRO_NC_TAG    = 1,
  LSM6DSOX_XL_NC_TAG,
  LSM6DSOX_TEMPERATURE_TAG,
  LSM6DSOX_TIMESTAMP_TAG,
  LSM6DSOX_CFG_CHANGE_TAG,
  LSM6DSOX_XL_NC_T_2_TAG,
  LSM6DSOX_XL_NC_T_1_TAG,
  LSM6DSOX_XL_2XC_TAG,
  LSM6DSOX_XL_3XC_TAG,
  LSM6DSOX_GYRO_NC_T_2_TAG,
  LSM6DSOX_GYRO_NC_T_1_TAG,
  LSM6DSOX_GYRO_2XC_TAG,
  LSM6DSOX_GYRO_3XC_TAG,
  LSM6DSOX_SENSORHUB_SLAVE0_TAG,
  LSM6DSOX_SENSORHUB_SLAVE1_TAG,
  LSM6DSOX_SENSORHUB_SLAVE2_TAG,
  LSM6DSOX_SENSORHUB_SLAVE3_TAG,
  LSM6DSOX_STEP_CPUNTER_TAG,
  LSM6DSOX_GAME_ROTATION_TAG,
  LSM6DSOX_GEOMAG_ROTATION_TAG,
  LSM6DSOX_ROTATION_TAG,
  LSM6DSOX_SENSORHUB_NACK_TAG  = 0x19,
} lsm6dsox_fifo_tag_t;
int32_t lsm6dsox_fifo_cnt_event_batch_set(lsm6dsox_ctx_t *ctx,
                                          lsm6dsox_trig_counter_bdr_t val);
int32_t lsm6dsox_fifo_cnt_event_batch_get(lsm6dsox_ctx_t *ctx,
                                          lsm6dsox_trig_counter_bdr_t *val);

int32_t lsm6dsox_rst_batch_counter_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_rst_batch_counter_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_batch_counter_threshold_set(lsm6dsox_ctx_t *ctx,
                                             uint16_t val);
int32_t lsm6dsox_batch_counter_threshold_get(lsm6dsox_ctx_t *ctx,
                                             uint16_t *val);

int32_t lsm6dsox_fifo_data_level_get(lsm6dsox_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsox_fifo_status_get(lsm6dsox_ctx_t *ctx,
                                 lsm6dsox_fifo_status2_t *val);

int32_t lsm6dsox_fifo_full_flag_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_fifo_ovr_flag_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_fifo_wtm_flag_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_fifo_sensor_tag_get(lsm6dsox_ctx_t *ctx,
                                     lsm6dsox_fifo_tag_t *val);

int32_t lsm6dsox_fifo_pedo_batch_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_fifo_pedo_batch_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_sh_batch_slave_0_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_batch_slave_0_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_sh_batch_slave_1_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_batch_slave_1_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_sh_batch_slave_2_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_batch_slave_2_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

