stm32duino/LSM6DSOX/src/lsm6dsox_reg.h
typedef struct {
  lsm6dsox_fsm_outs1_t    fsm_outs1;
  lsm6dsox_fsm_outs2_t    fsm_outs2;
  lsm6dsox_fsm_outs3_t    fsm_outs3;
  lsm6dsox_fsm_outs4_t    fsm_outs4;
  lsm6dsox_fsm_outs5_t    fsm_outs5;
  lsm6dsox_fsm_outs6_t    fsm_outs6;
  lsm6dsox_fsm_outs7_t    fsm_outs7;
  lsm6dsox_fsm_outs8_t    fsm_outs8;
  lsm6dsox_fsm_outs1_t    fsm_outs9;
  lsm6dsox_fsm_outs2_t    fsm_outs10;
  lsm6dsox_fsm_outs3_t    fsm_outs11;
  lsm6dsox_fsm_outs4_t    fsm_outs12;
  lsm6dsox_fsm_outs5_t    fsm_outs13;
  lsm6dsox_fsm_outs6_t    fsm_outs14;
  lsm6dsox_fsm_outs7_t    fsm_outs15;
  lsm6dsox_fsm_outs8_t    fsm_outs16;
} lsm6dsox_fsm_out_t;
int32_t lsm6dsox_fsm_out_get(lsm6dsox_ctx_t *ctx, lsm6dsox_fsm_out_t *val);

typedef enum {
  LSM6DSOX_ODR_FSM_12Hz5 = 0,
  LSM6DSOX_ODR_FSM_26Hz  = 1,
  LSM6DSOX_ODR_FSM_52Hz  = 2,
  LSM6DSOX_ODR_FSM_104Hz = 3,
} lsm6dsox_fsm_odr_t;
int32_t lsm6dsox_fsm_data_rate_set(lsm6dsox_ctx_t *ctx, lsm6dsox_fsm_odr_t val);
int32_t lsm6dsox_fsm_data_rate_get(lsm6dsox_ctx_t *ctx, lsm6dsox_fsm_odr_t *val);

int32_t lsm6dsox_fsm_init_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_fsm_init_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_long_cnt_int_value_set(lsm6dsox_ctx_t *ctx, uint16_t val);
int32_t lsm6dsox_long_cnt_int_value_get(lsm6dsox_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsox_fsm_number_of_programs_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_fsm_number_of_programs_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsox_fsm_start_address_set(lsm6dsox_ctx_t *ctx, uint16_t val);
int32_t lsm6dsox_fsm_start_address_get(lsm6dsox_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsox_mlc_status_get(lsm6dsox_ctx_t *ctx,
                                lsm6dsox_mlc_status_mainpage_t *val);

typedef enum {
  LSM6DSOX_ODR_PRGS_12Hz5 = 0,
  LSM6DSOX_ODR_PRGS_26Hz  = 1,
  LSM6DSOX_ODR_PRGS_52Hz  = 2,
  LSM6DSOX_ODR_PRGS_104Hz = 3,
} lsm6dsox_mlc_odr_t;
int32_t lsm6dsox_mlc_data_rate_set(lsm6dsox_ctx_t *ctx,
                                   lsm6dsox_mlc_odr_t val);
int32_t lsm6dsox_mlc_data_rate_get(lsm6dsox_ctx_t *ctx,
                                   lsm6dsox_mlc_odr_t *val);

typedef struct {
  lsm6dsox_sensor_hub_1_t   sh_byte_1;
  lsm6dsox_sensor_hub_2_t   sh_byte_2;
  lsm6dsox_sensor_hub_3_t   sh_byte_3;
  lsm6dsox_sensor_hub_4_t   sh_byte_4;
  lsm6dsox_sensor_hub_5_t   sh_byte_5;
  lsm6dsox_sensor_hub_6_t   sh_byte_6;
  lsm6dsox_sensor_hub_7_t   sh_byte_7;
  lsm6dsox_sensor_hub_8_t   sh_byte_8;
  lsm6dsox_sensor_hub_9_t   sh_byte_9;
  lsm6dsox_sensor_hub_10_t  sh_byte_10;
  lsm6dsox_sensor_hub_11_t  sh_byte_11;
  lsm6dsox_sensor_hub_12_t  sh_byte_12;
  lsm6dsox_sensor_hub_13_t  sh_byte_13;
  lsm6dsox_sensor_hub_14_t  sh_byte_14;
  lsm6dsox_sensor_hub_15_t  sh_byte_15;
  lsm6dsox_sensor_hub_16_t  sh_byte_16;
  lsm6dsox_sensor_hub_17_t  sh_byte_17;
  lsm6dsox_sensor_hub_18_t  sh_byte_18;
} lsm6dsox_emb_sh_read_t;
int32_t lsm6dsox_sh_read_data_raw_get(lsm6dsox_ctx_t *ctx,
                                      lsm6dsox_emb_sh_read_t *val,
                                      uint8_t len);

typedef enum {
  LSM6DSOX_SLV_0       = 0,
  LSM6DSOX_SLV_0_1     = 1,
  LSM6DSOX_SLV_0_1_2   = 2,
  LSM6DSOX_SLV_0_1_2_3 = 3,
} lsm6dsox_aux_sens_on_t;
int32_t lsm6dsox_sh_slave_connected_set(lsm6dsox_ctx_t *ctx,
                                        lsm6dsox_aux_sens_on_t val);
int32_t lsm6dsox_sh_slave_connected_get(lsm6dsox_ctx_t *ctx,
                                        lsm6dsox_aux_sens_on_t *val);

int32_t lsm6dsox_sh_master_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_master_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSOX_EXT_PULL_UP      = 0,
  LSM6DSOX_INTERNAL_PULL_UP = 1,
} lsm6dsox_shub_pu_en_t;
int32_t lsm6dsox_sh_pin_mode_set(lsm6dsox_ctx_t *ctx, lsm6dsox_shub_pu_en_t val);
int32_t lsm6dsox_sh_pin_mode_get(lsm6dsox_ctx_t *ctx, lsm6dsox_shub_pu_en_t *val);

int32_t lsm6dsox_sh_pass_through_set(lsm6dsox_ctx_t *ctx, uint8_t val);
int32_t lsm6dsox_sh_pass_through_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSOX_EXT_ON_INT2_PIN = 1,
  LSM6DSOX_XL_GY_DRDY      = 0,
} lsm6dsox_start_config_t;
int32_t lsm6dsox_sh_syncro_mode_set(lsm6dsox_ctx_t *ctx,
                                    lsm6dsox_start_config_t val);
int32_t lsm6dsox_sh_syncro_mode_get(lsm6dsox_ctx_t *ctx,
                                    lsm6dsox_start_config_t *val);

typedef enum {
  LSM6DSOX_EACH_SH_CYCLE    = 0,
  LSM6DSOX_ONLY_FIRST_CYCLE = 1,
} lsm6dsox_write_once_t;
int32_t lsm6dsox_sh_write_mode_set(lsm6dsox_ctx_t *ctx,
                                   lsm6dsox_write_once_t val);
int32_t lsm6dsox_sh_write_mode_get(lsm6dsox_ctx_t *ctx,
                                   lsm6dsox_write_once_t *val);

int32_t lsm6dsox_sh_reset_set(lsm6dsox_ctx_t *ctx);
int32_t lsm6dsox_sh_reset_get(lsm6dsox_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSOX_SH_ODR_104Hz = 0,
  LSM6DSOX_SH_ODR_52Hz  = 1,
  LSM6DSOX_SH_ODR_26Hz  = 2,
  LSM6DSOX_SH_ODR_13Hz  = 3,
} lsm6dsox_shub_odr_t;
int32_t lsm6dsox_sh_data_rate_set(lsm6dsox_ctx_t *ctx, lsm6dsox_shub_odr_t val);
int32_t lsm6dsox_sh_data_rate_get(lsm6dsox_ctx_t *ctx, lsm6dsox_shub_odr_t *val);

typedef struct {
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dsox_sh_cfg_write_t;
int32_t lsm6dsox_sh_cfg_write(lsm6dsox_ctx_t *ctx, lsm6dsox_sh_cfg_write_t *val);

typedef struct {
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dsox_sh_cfg_read_t;
int32_t lsm6dsox_sh_slv0_cfg_read(lsm6dsox_ctx_t *ctx,
                                  lsm6dsox_sh_cfg_read_t *val);
int32_t lsm6dsox_sh_slv1_cfg_read(lsm6dsox_ctx_t *ctx,
                                  lsm6dsox_sh_cfg_read_t *val);
int32_t lsm6dsox_sh_slv2_cfg_read(lsm6dsox_ctx_t *ctx,
                                  lsm6dsox_sh_cfg_read_t *val);
int32_t lsm6dsox_sh_slv3_cfg_read(lsm6dsox_ctx_t *ctx,
                                  lsm6dsox_sh_cfg_read_t *val);

int32_t lsm6dsox_sh_status_get(lsm6dsox_ctx_t *ctx,
                               lsm6dsox_status_master_t *val);
typedef enum {
  LSM6DSOX_S4S_TPH_7bit   = 0,
  LSM6DSOX_S4S_TPH_15bit  = 1,
} lsm6dsox_s4s_tph_res_t;
int32_t lsm6dsox_s4s_tph_res_set(lsm6dsox_ctx_t *ctx,
                                 lsm6dsox_s4s_tph_res_t val);
int32_t lsm6dsox_s4s_tph_res_get(lsm6dsox_ctx_t *ctx,
                                 lsm6dsox_s4s_tph_res_t *val);

